// Лабораторная работа 6, задача 8. Выполнена: Сивый А.А.
/*У вас есть строка s и фишка, которую вы можете поставить на любой символ
этой строки.
После того, как вы поставите фишку, вы можете подвинуть ее вправо
несколько (возможно, ноль) раз, то есть сделать следующее действие
несколько раз: если текущая позиция фишки обозначена как i, фишка
перемещается в позицию i+1. Конечно же, это действие невозможно, если
фишка находится в последней позиции строки.
После того, как вы закончите двигать фишку вправо, вы можете подвинуть ее
влево несколько (возможно, ноль) раз, то есть сделать следующее действие
несколько раз: если текущая позиция фишки обозначена как i, фишка
перемещается в позицию i−1. Конечно же, это действие невозможно, если
фишка находится в первой позиции строки.
Когда вы ставите фишку или перемещаете ее, вы выписываете символ, на
котором оказалась фишка. Например, если строка s — abcdef, вы ставите
фишку на 3-й символ, двигаете ее вправо 2 раза, а затем двигаете ее влево 3
раза, вы выпишете строку cdedcb.
Вам даны две строки s и t. Ваше задание — определить, можно ли так
выполнить описанные операции со строкой s, что в результате вы выпишете
строку t.*/
#include <iostream>
#include <string>



using namespace std;



void proverka(string s, string t)
{
	bool index = false;
	string tmp = t;
	for (int i = 0; i < size(t); i++)
	{
		tmp[i] = 0;
	}

	for (int i = 0; i < size(s); i++)
	{
		if (s[i] == t[0])
		{
			int j = 1;
			int metka = i;
			tmp[0] = t[0];
			while (j < size(t) && metka < size(s))
			{
				if (s[metka + 1] == t[j])
				{
					metka++;
					tmp[j] = t[j];
					j++;
				}
				else
					break;
			}
			while (j < size(t) && metka > 0)
			{
					if (s[metka - 1] == t[j])
					{
						metka--;
						tmp[j] = t[j];
						j++;
					}
					else
						break;
			}
			if (tmp == t)
				index = true;
			else
				for (int j = 0; j < size(t); j++)
					tmp[i] = 0;

		}
	}
	if (index)
		cout << "\nYes\n";
	else
		cout << "\nNo\n";
}
int main()
{
	int N;
	setlocale(LC_ALL, "ru");
	string s;
	string t;
	cout << "Введите количество наборов входных данных\n";
	while (!(cin >> N))
	{
		cout << "Введите корректное значение\n";
		cin.clear();
		cin.ignore(10000, '\n');
	}
	for (int i = 0; i < N; i++)
	{
		cout << "Введите строку s\n";
		cin.ignore();
		getline(cin, s);
		cout << "Введите строку t\n";
		cin.ignore();
		getline(cin, t);
		proverka(s, t);
	}
	return 0;
}

