// Лабораторная работа 4, задача 15. Выполнена: Сивый А.А.
/*таблица заполняется по следующему алгоритму:
В таблицу вносятся все натуральные числа по порядку. 1 становится в левую верхнюю ячейку, затем выбирается самая левая незаполненная ячейка
в самой первой строке таблицы и заполняется. Затем, пока у последрней заполненной ячейки сосед слева существует и заполнен, опускаемся 
вниз и заполняем очередную ячейку. Когда же не окажется соседа слева, то начинается заполнение клеток справа налево. После того как будет
заполнена ячейка в первом столбце. После этого алгоритм заполнения повторяется. Необходимо вывести строку и столбец в котором будет
находиться число, введённое с клавиатуры.*/
#include <iostream>
#include <cmath>

using namespace std; 

int main()
{
	int N, size, number,k,g;
	setlocale(LC_ALL, "Russian");
	cout << "Введите число\n";
	while (!(cin >> N) || N < 1 || N != round(N))
	{
		cin.clear();
		cin.ignore(10000, '\n');
		cout << "Введите корректное значение\n";
	}
	for (int i = 0;;i++)
	{
		if (N > pow(i, 2))
		{
			continue;
		}
		else
		{
			size = i;
			break;
		}
	}
	int** arr = (int**)calloc(size, sizeof(int*));
	for (int i = 0; i < size; i++)
	{
		arr[i] = (int*)calloc(size, sizeof(int*));
	}
	int a = 1, b = 1;
	number = 1;
	arr[0][0] = number;
	if (N == 1)
	{
		cout << "Введённое число находится в строке: 1 и столбце: 1\n";
	}
	for (int a = 1; a < size; a++)
	{
		for (int k = 0; k <= a; k++)
		{
			number++;
			arr[k][a] = number;
			if (number == N)
			{
				cout << "Введённое число находится в строке: " << k +1 << " и столбце: " << a +1 << endl;
				return 0;
			}
		}
		for (int g = a -1; g >= 0; g--)
		{
			number++;
			arr[a][g] = number;
			if (number == N)
			{
				cout << "Введённое число находится в строке : " << a + 1 << " и столбце : " << g + 1 << endl;
				return 0;
			}
		}
	}
	for (int i = 0; i < size; i++)
	{
		free(arr[i]);
	}
	free(arr);
	return 0;
}
