// Лабораторная работа 5, задача 1. Выполнена: Сивый А.А.
/*Вариант 9. Сформировать двумерный динамический массив-матрицу А размерностью n*n (n = 10),причём
значения a[i][j] определить согласно выражению:
a[i][j] = 2 i j^2 - 2j, если i < 5;
a[i][j] = 3 i j-3, если i > 5;
при i = 1, 2, ..., n, j = 1, 2, ... , n.
Сформировать транспонированную матрицу B = A^T
Определить сумму элементов четных строк и нечетных столбцов для массива-матрицы А и сумму чётных
столбцов и нечетных строк для массива-матрицы В. На экран вывести массивы-матрицы А и В построчно
и значения сумм.Использовать функции.
*/
#include <iostream>
#include "func.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");
	int n = 10, k, g;
	int** A = new int* [n * n];
	for (int i = 0; i < n; i++)
	{
		A[i] = new int[n];
	}
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			k = i + 1;
			g = j + 1;
			if (k <= 5)
			{
				A[i][j] = 2 * k * g * g - 2 * g;
			}
			else if (k > 5)
			{
				A[i][j] = 3 * k * g - 3;
			}
		}
	}
	int** B = new int* [n];
	for (int i = 0; i < n; i++)
	{
		B[i] = new int[n];
	}
	Transp(A, B, n);
	cout << "Матрица A\n";
	Sum(A, n, 0);
	cout << "Матрица B\n";
	Sum(B, n, 1);
	for (int i = 0; i < n; i++)
	{
		delete[] A[i];
		delete[] B[i];
	}
	delete[] A;
	delete[] B;
	return 0;
}