// Лабораторная работа 4, задача 1. Выполенена: Сивый А.А.
/*Ввести одномерный статический массив из k чисел. Выполнить в соответсвии с номером варианта индивидуальное задание
и вывести на экран исходные данные и полученный результат.
Вариант 9: Сформировать два новых массива: в первый записать отрицательные элементы исходного массива, во второй-все остальные*/
#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	double x;
	int m = 0, g = 0;
	const int k = 10;
	double arr[k],arr1[k], arr2[k];
	cout << "Введите массив из " << k << " элементов \n";
	for (int i = 0; i < k; i++)
	{
		while (!(cin >> x) || x != round(x))
		{
			cin.clear();
			cin.ignore(10000, '\n');
			cout << "Введите корректное значение\n";
		}
		arr[i] = x;
		if (x < 0)
		{
			arr1[m] = x;
			m += 1;
		}
		else
		{
			arr2[g] = x;
			g += 1;
		}
	}
	cout << endl << "Исходный массив:\n";
	for (int i = 0; i < k; i++)
	{
		cout << arr[i] << " ";
	}
	cout << endl << "Массив с отрицательными значениями:\n";
	for (int i = 0; i < m; i++)
		cout << arr1[i] << " ";
	cout << endl <<"Массив с остальными значениями:\n";
	for (int i = 0; i < g; i++)
		cout << arr2[i] << " ";
	return 0;
}
